---
kind: method
id: M:Autodesk.Revit.DB.Events.ViewsExportingByContextEventArgs.GetViewIds
source: html/9fbae1ad-926b-f67a-716f-299bf13ddf4a.htm
---
# Autodesk.Revit.DB.Events.ViewsExportingByContextEventArgs.GetViewIds Method

Gets the views about to be exported by CustomExporter.

## Syntax (C#)
```csharp
public IList<ElementId> GetViewIds()
```

## Returns
The views about to be exported by CustomExporter.